foxval/esp-idf/components/soc/esp32c/include/soc/extmem_reg.h
#define DPORT_IC_PRELOAD_EVICT_CNT_REG          (DR_REG_EXTMEM_BASE + 0x084)
/* DPORT_IC_PRELOAD_EVICT_CNT : RO ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: */
#define DPORT_IC_PRELOAD_EVICT_CNT  0x0000FFFF
#define DPORT_IC_PRELOAD_EVICT_CNT_M  ((DPORT_IC_PRELOAD_EVICT_CNT_V)<<(DPORT_IC_PRELOAD_EVICT_CNT_S))
#define DPORT_IC_PRELOAD_EVICT_CNT_V  0xFFFF
#define DPORT_IC_PRELOAD_EVICT_CNT_S  0

#define DPORT_IC_PRELOAD_MISS_CNT_REG          (DR_REG_EXTMEM_BASE + 0x088)
/* DPORT_IC_PRELOAD_MISS_CNT : RO ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: */
#define DPORT_IC_PRELOAD_MISS_CNT  0x0000FFFF
#define DPORT_IC_PRELOAD_MISS_CNT_M  ((DPORT_IC_PRELOAD_MISS_CNT_V)<<(DPORT_IC_PRELOAD_MISS_CNT_S))
#define DPORT_IC_PRELOAD_MISS_CNT_V  0xFFFF
#define DPORT_IC_PRELOAD_MISS_CNT_S  0

#define DPORT_IBUS3_ABANDON_CNT_REG          (DR_REG_EXTMEM_BASE + 0x08C)
/* DPORT_IBUS3_ABANDON_CNT : RO ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: */
#define DPORT_IBUS3_ABANDON_CNT  0x0000FFFF
#define DPORT_IBUS3_ABANDON_CNT_M  ((DPORT_IBUS3_ABANDON_CNT_V)<<(DPORT_IBUS3_ABANDON_CNT_S))
#define DPORT_IBUS3_ABANDON_CNT_V  0xFFFF
#define DPORT_IBUS3_ABANDON_CNT_S  0

#define DPORT_IBUS2_ABANDON_CNT_REG          (DR_REG_EXTMEM_BASE + 0x090)
/* DPORT_IBUS2_ABANDON_CNT : RO ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: */
#define DPORT_IBUS2_ABANDON_CNT  0x0000FFFF
#define DPORT_IBUS2_ABANDON_CNT_M  ((DPORT_IBUS2_ABANDON_CNT_V)<<(DPORT_IBUS2_ABANDON_CNT_S))
#define DPORT_IBUS2_ABANDON_CNT_V  0xFFFF
#define DPORT_IBUS2_ABANDON_CNT_S  0

#define DPORT_IBUS1_ABANDON_CNT_REG          (DR_REG_EXTMEM_BASE + 0x094)
/* DPORT_IBUS1_ABANDON_CNT : RO ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: */
#define DPORT_IBUS1_ABANDON_CNT  0x0000FFFF
#define DPORT_IBUS1_ABANDON_CNT_M  ((DPORT_IBUS1_ABANDON_CNT_V)<<(DPORT_IBUS1_ABANDON_CNT_S))
#define DPORT_IBUS1_ABANDON_CNT_V  0xFFFF
#define DPORT_IBUS1_ABANDON_CNT_S  0

#define DPORT_IBUS0_ABANDON_CNT_REG          (DR_REG_EXTMEM_BASE + 0x098)
/* DPORT_IBUS0_ABANDON_CNT : RO ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: */
#define DPORT_IBUS0_ABANDON_CNT  0x0000FFFF
#define DPORT_IBUS0_ABANDON_CNT_M  ((DPORT_IBUS0_ABANDON_CNT_V)<<(DPORT_IBUS0_ABANDON_CNT_S))
#define DPORT_IBUS0_ABANDON_CNT_V  0xFFFF
#define DPORT_IBUS0_ABANDON_CNT_S  0

#define DPORT_IBUS3_ACS_MISS_CNT_REG          (DR_REG_EXTMEM_BASE + 0x09C)
/* DPORT_IBUS3_ACS_MISS_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define DPORT_IBUS3_ACS_MISS_CNT  0xFFFFFFFF
#define DPORT_IBUS3_ACS_MISS_CNT_M  ((DPORT_IBUS3_ACS_MISS_CNT_V)<<(DPORT_IBUS3_ACS_MISS_CNT_S))
#define DPORT_IBUS3_ACS_MISS_CNT_V  0xFFFFFFFF
#define DPORT_IBUS3_ACS_MISS_CNT_S  0

#define DPORT_IBUS2_ACS_MISS_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0A0)
/* DPORT_IBUS2_ACS_MISS_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define DPORT_IBUS2_ACS_MISS_CNT  0xFFFFFFFF
#define DPORT_IBUS2_ACS_MISS_CNT_M  ((DPORT_IBUS2_ACS_MISS_CNT_V)<<(DPORT_IBUS2_ACS_MISS_CNT_S))
#define DPORT_IBUS2_ACS_MISS_CNT_V  0xFFFFFFFF
#define DPORT_IBUS2_ACS_MISS_CNT_S  0

#define DPORT_IBUS1_ACS_MISS_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0A4)
/* DPORT_IBUS1_ACS_MISS_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define DPORT_IBUS1_ACS_MISS_CNT  0xFFFFFFFF
#define DPORT_IBUS1_ACS_MISS_CNT_M  ((DPORT_IBUS1_ACS_MISS_CNT_V)<<(DPORT_IBUS1_ACS_MISS_CNT_S))
#define DPORT_IBUS1_ACS_MISS_CNT_V  0xFFFFFFFF
#define DPORT_IBUS1_ACS_MISS_CNT_S  0

#define DPORT_IBUS0_ACS_MISS_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0A8)
/* DPORT_IBUS0_ACS_MISS_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define DPORT_IBUS0_ACS_MISS_CNT  0xFFFFFFFF
#define DPORT_IBUS0_ACS_MISS_CNT_M  ((DPORT_IBUS0_ACS_MISS_CNT_V)<<(DPORT_IBUS0_ACS_MISS_CNT_S))
#define DPORT_IBUS0_ACS_MISS_CNT_V  0xFFFFFFFF
#define DPORT_IBUS0_ACS_MISS_CNT_S  0

#define DPORT_IBUS3_ACS_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0AC)
/* DPORT_IBUS3_ACS_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define DPORT_IBUS3_ACS_CNT  0xFFFFFFFF
#define DPORT_IBUS3_ACS_CNT_M  ((DPORT_IBUS3_ACS_CNT_V)<<(DPORT_IBUS3_ACS_CNT_S))
#define DPORT_IBUS3_ACS_CNT_V  0xFFFFFFFF
#define DPORT_IBUS3_ACS_CNT_S  0

#define DPORT_IBUS2_ACS_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0B0)
/* DPORT_IBUS2_ACS_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define DPORT_IBUS2_ACS_CNT  0xFFFFFFFF
#define DPORT_IBUS2_ACS_CNT_M  ((DPORT_IBUS2_ACS_CNT_V)<<(DPORT_IBUS2_ACS_CNT_S))
#define DPORT_IBUS2_ACS_CNT_V  0xFFFFFFFF
#define DPORT_IBUS2_ACS_CNT_S  0

#define DPORT_IBUS1_ACS_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0B4)
/* DPORT_IBUS1_ACS_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define DPORT_IBUS1_ACS_CNT  0xFFFFFFFF
#define DPORT_IBUS1_ACS_CNT_M  ((DPORT_IBUS1_ACS_CNT_V)<<(DPORT_IBUS1_ACS_CNT_S))
#define DPORT_IBUS1_ACS_CNT_V  0xFFFFFFFF
#define DPORT_IBUS1_ACS_CNT_S  0

#define DPORT_IBUS0_ACS_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0B8)
/* DPORT_IBUS0_ACS_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define DPORT_IBUS0_ACS_CNT  0xFFFFFFFF
#define DPORT_IBUS0_ACS_CNT_M  ((DPORT_IBUS0_ACS_CNT_V)<<(DPORT_IBUS0_ACS_CNT_S))
#define DPORT_IBUS0_ACS_CNT_V  0xFFFFFFFF
#define DPORT_IBUS0_ACS_CNT_S  0

#define DPORT_DC_PRELOAD_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0BC)
/* DPORT_DC_PRELOAD_CNT : RO ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: */
#define DPORT_DC_PRELOAD_CNT  0x0000FFFF
#define DPORT_DC_PRELOAD_CNT_M  ((DPORT_DC_PRELOAD_CNT_V)<<(DPORT_DC_PRELOAD_CNT_S))
#define DPORT_DC_PRELOAD_CNT_V  0xFFFF
#define DPORT_DC_PRELOAD_CNT_S  0

#define DPORT_DC_PRELOAD_EVICT_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0C0)
/* DPORT_DC_PRELOAD_EVICT_CNT : RO ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: */
#define DPORT_DC_PRELOAD_EVICT_CNT  0x0000FFFF
#define DPORT_DC_PRELOAD_EVICT_CNT_M  ((DPORT_DC_PRELOAD_EVICT_CNT_V)<<(DPORT_DC_PRELOAD_EVICT_CNT_S))
#define DPORT_DC_PRELOAD_EVICT_CNT_V  0xFFFF
#define DPORT_DC_PRELOAD_EVICT_CNT_S  0

#define DPORT_DC_PRELOAD_MISS_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0C4)
/* DPORT_DC_PRELOAD_MISS_CNT : RO ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: */
#define DPORT_DC_PRELOAD_MISS_CNT  0x0000FFFF
#define DPORT_DC_PRELOAD_MISS_CNT_M  ((DPORT_DC_PRELOAD_MISS_CNT_V)<<(DPORT_DC_PRELOAD_MISS_CNT_S))
#define DPORT_DC_PRELOAD_MISS_CNT_V  0xFFFF
#define DPORT_DC_PRELOAD_MISS_CNT_S  0

#define DPORT_DBUS3_ABANDON_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0C8)
/* DPORT_DBUS3_ABANDON_CNT : RO ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: */
#define DPORT_DBUS3_ABANDON_CNT  0x0000FFFF
#define DPORT_DBUS3_ABANDON_CNT_M  ((DPORT_DBUS3_ABANDON_CNT_V)<<(DPORT_DBUS3_ABANDON_CNT_S))
#define DPORT_DBUS3_ABANDON_CNT_V  0xFFFF
#define DPORT_DBUS3_ABANDON_CNT_S  0

