foxval/esp-idf/components/soc/esp32c/include/soc/extmem_reg.h
#define DPORT_DBUS2_ABANDON_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0CC)
/* DPORT_DBUS2_ABANDON_CNT : RO ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: */
#define DPORT_DBUS2_ABANDON_CNT  0x0000FFFF
#define DPORT_DBUS2_ABANDON_CNT_M  ((DPORT_DBUS2_ABANDON_CNT_V)<<(DPORT_DBUS2_ABANDON_CNT_S))
#define DPORT_DBUS2_ABANDON_CNT_V  0xFFFF
#define DPORT_DBUS2_ABANDON_CNT_S  0

#define DPORT_DBUS1_ABANDON_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0D0)
/* DPORT_DBUS1_ABANDON_CNT : RO ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: */
#define DPORT_DBUS1_ABANDON_CNT  0x0000FFFF
#define DPORT_DBUS1_ABANDON_CNT_M  ((DPORT_DBUS1_ABANDON_CNT_V)<<(DPORT_DBUS1_ABANDON_CNT_S))
#define DPORT_DBUS1_ABANDON_CNT_V  0xFFFF
#define DPORT_DBUS1_ABANDON_CNT_S  0

#define DPORT_DBUS0_ABANDON_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0D4)
/* DPORT_DBUS0_ABANDON_CNT : RO ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: */
#define DPORT_DBUS0_ABANDON_CNT  0x0000FFFF
#define DPORT_DBUS0_ABANDON_CNT_M  ((DPORT_DBUS0_ABANDON_CNT_V)<<(DPORT_DBUS0_ABANDON_CNT_S))
#define DPORT_DBUS0_ABANDON_CNT_V  0xFFFF
#define DPORT_DBUS0_ABANDON_CNT_S  0

#define DPORT_DBUS3_ACS_WB_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0D8)
/* DPORT_DBUS3_ACS_WB_CNT : RO ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: */
#define DPORT_DBUS3_ACS_WB_CNT  0x000FFFFF
#define DPORT_DBUS3_ACS_WB_CNT_M  ((DPORT_DBUS3_ACS_WB_CNT_V)<<(DPORT_DBUS3_ACS_WB_CNT_S))
#define DPORT_DBUS3_ACS_WB_CNT_V  0xFFFFF
#define DPORT_DBUS3_ACS_WB_CNT_S  0

#define DPORT_DBUS2_ACS_WB_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0DC)
/* DPORT_DBUS2_ACS_WB_CNT : RO ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: */
#define DPORT_DBUS2_ACS_WB_CNT  0x000FFFFF
#define DPORT_DBUS2_ACS_WB_CNT_M  ((DPORT_DBUS2_ACS_WB_CNT_V)<<(DPORT_DBUS2_ACS_WB_CNT_S))
#define DPORT_DBUS2_ACS_WB_CNT_V  0xFFFFF
#define DPORT_DBUS2_ACS_WB_CNT_S  0

#define DPORT_DBUS1_ACS_WB_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0E0)
/* DPORT_DBUS1_ACS_WB_CNT : RO ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: */
#define DPORT_DBUS1_ACS_WB_CNT  0x000FFFFF
#define DPORT_DBUS1_ACS_WB_CNT_M  ((DPORT_DBUS1_ACS_WB_CNT_V)<<(DPORT_DBUS1_ACS_WB_CNT_S))
#define DPORT_DBUS1_ACS_WB_CNT_V  0xFFFFF
#define DPORT_DBUS1_ACS_WB_CNT_S  0

#define DPORT_DBUS0_ACS_WB_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0E4)
/* DPORT_DBUS0_ACS_WB_CNT : RO ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: */
#define DPORT_DBUS0_ACS_WB_CNT  0x000FFFFF
#define DPORT_DBUS0_ACS_WB_CNT_M  ((DPORT_DBUS0_ACS_WB_CNT_V)<<(DPORT_DBUS0_ACS_WB_CNT_S))
#define DPORT_DBUS0_ACS_WB_CNT_V  0xFFFFF
#define DPORT_DBUS0_ACS_WB_CNT_S  0

#define DPORT_DBUS3_ACS_MISS_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0E8)
/* DPORT_DBUS3_ACS_MISS_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define DPORT_DBUS3_ACS_MISS_CNT  0xFFFFFFFF
#define DPORT_DBUS3_ACS_MISS_CNT_M  ((DPORT_DBUS3_ACS_MISS_CNT_V)<<(DPORT_DBUS3_ACS_MISS_CNT_S))
#define DPORT_DBUS3_ACS_MISS_CNT_V  0xFFFFFFFF
#define DPORT_DBUS3_ACS_MISS_CNT_S  0

#define DPORT_DBUS2_ACS_MISS_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0EC)
/* DPORT_DBUS2_ACS_MISS_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define DPORT_DBUS2_ACS_MISS_CNT  0xFFFFFFFF
#define DPORT_DBUS2_ACS_MISS_CNT_M  ((DPORT_DBUS2_ACS_MISS_CNT_V)<<(DPORT_DBUS2_ACS_MISS_CNT_S))
#define DPORT_DBUS2_ACS_MISS_CNT_V  0xFFFFFFFF
#define DPORT_DBUS2_ACS_MISS_CNT_S  0

#define DPORT_DBUS1_ACS_MISS_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0F0)
/* DPORT_DBUS1_ACS_MISS_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define DPORT_DBUS1_ACS_MISS_CNT  0xFFFFFFFF
#define DPORT_DBUS1_ACS_MISS_CNT_M  ((DPORT_DBUS1_ACS_MISS_CNT_V)<<(DPORT_DBUS1_ACS_MISS_CNT_S))
#define DPORT_DBUS1_ACS_MISS_CNT_V  0xFFFFFFFF
#define DPORT_DBUS1_ACS_MISS_CNT_S  0

#define DPORT_DBUS0_ACS_MISS_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0F4)
/* DPORT_DBUS0_ACS_MISS_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define DPORT_DBUS0_ACS_MISS_CNT  0xFFFFFFFF
#define DPORT_DBUS0_ACS_MISS_CNT_M  ((DPORT_DBUS0_ACS_MISS_CNT_V)<<(DPORT_DBUS0_ACS_MISS_CNT_S))
#define DPORT_DBUS0_ACS_MISS_CNT_V  0xFFFFFFFF
#define DPORT_DBUS0_ACS_MISS_CNT_S  0

#define DPORT_DBUS3_ACS_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0F8)
/* DPORT_DBUS3_ACS_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define DPORT_DBUS3_ACS_CNT  0xFFFFFFFF
#define DPORT_DBUS3_ACS_CNT_M  ((DPORT_DBUS3_ACS_CNT_V)<<(DPORT_DBUS3_ACS_CNT_S))
#define DPORT_DBUS3_ACS_CNT_V  0xFFFFFFFF
#define DPORT_DBUS3_ACS_CNT_S  0

#define DPORT_DBUS2_ACS_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0FC)
/* DPORT_DBUS2_ACS_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define DPORT_DBUS2_ACS_CNT  0xFFFFFFFF
#define DPORT_DBUS2_ACS_CNT_M  ((DPORT_DBUS2_ACS_CNT_V)<<(DPORT_DBUS2_ACS_CNT_S))
#define DPORT_DBUS2_ACS_CNT_V  0xFFFFFFFF
#define DPORT_DBUS2_ACS_CNT_S  0

#define DPORT_DBUS1_ACS_CNT_REG          (DR_REG_EXTMEM_BASE + 0x100)
/* DPORT_DBUS1_ACS_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define DPORT_DBUS1_ACS_CNT  0xFFFFFFFF
#define DPORT_DBUS1_ACS_CNT_M  ((DPORT_DBUS1_ACS_CNT_V)<<(DPORT_DBUS1_ACS_CNT_S))
#define DPORT_DBUS1_ACS_CNT_V  0xFFFFFFFF
#define DPORT_DBUS1_ACS_CNT_S  0

#define DPORT_DBUS0_ACS_CNT_REG          (DR_REG_EXTMEM_BASE + 0x104)
/* DPORT_DBUS0_ACS_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define DPORT_DBUS0_ACS_CNT  0xFFFFFFFF
#define DPORT_DBUS0_ACS_CNT_M  ((DPORT_DBUS0_ACS_CNT_V)<<(DPORT_DBUS0_ACS_CNT_S))
#define DPORT_DBUS0_ACS_CNT_V  0xFFFFFFFF
#define DPORT_DBUS0_ACS_CNT_S  0

#define DPORT_PRO_CACHE_IA_INT_EN_REG DPORT_CACHE_DBG_INT_ENA_REG
#define DPORT_PRO_CACHE_INT_CLR DPORT_CACHE_DBG_INT_CLR
#define DPORT_PRO_CACHE_DBG_EN DPORT_CACHE_DBG_EN
#define DPORT_CACHE_DBG_INT_ENA_REG          (DR_REG_EXTMEM_BASE + 0x108)
/* DPORT_MMU_ENTRY_FAULT_INT_ENA : R/W ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define DPORT_MMU_ENTRY_FAULT_INT_ENA  (BIT(13))
#define DPORT_MMU_ENTRY_FAULT_INT_ENA_M  (BIT(13))
#define DPORT_MMU_ENTRY_FAULT_INT_ENA_V  0x1
#define DPORT_MMU_ENTRY_FAULT_INT_ENA_S  13
/* DPORT_DCACHE_REJECT_INT_ENA : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define DPORT_DCACHE_REJECT_INT_ENA  (BIT(12))
#define DPORT_DCACHE_REJECT_INT_ENA_M  (BIT(12))
#define DPORT_DCACHE_REJECT_INT_ENA_V  0x1
#define DPORT_DCACHE_REJECT_INT_ENA_S  12
/* DPORT_DCACHE_WRITE_FLASH_INT_ENA : R/W ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define DPORT_DCACHE_WRITE_FLASH_INT_ENA  (BIT(11))
#define DPORT_DCACHE_WRITE_FLASH_INT_ENA_M  (BIT(11))
#define DPORT_DCACHE_WRITE_FLASH_INT_ENA_V  0x1
#define DPORT_DCACHE_WRITE_FLASH_INT_ENA_S  11
/* DPORT_DC_PRELOAD_SIZE_FAULT_INT_ENA : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define DPORT_DC_PRELOAD_SIZE_FAULT_INT_ENA  (BIT(10))
#define DPORT_DC_PRELOAD_SIZE_FAULT_INT_ENA_M  (BIT(10))
#define DPORT_DC_PRELOAD_SIZE_FAULT_INT_ENA_V  0x1
#define DPORT_DC_PRELOAD_SIZE_FAULT_INT_ENA_S  10
/* DPORT_DC_SYNC_SIZE_FAULT_INT_ENA : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define DPORT_DC_SYNC_SIZE_FAULT_INT_ENA  (BIT(9))
#define DPORT_DC_SYNC_SIZE_FAULT_INT_ENA_M  (BIT(9))
#define DPORT_DC_SYNC_SIZE_FAULT_INT_ENA_V  0x1
#define DPORT_DC_SYNC_SIZE_FAULT_INT_ENA_S  9
/* DPORT_DBUS_CNT_OVF_INT_ENA : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define DPORT_DBUS_CNT_OVF_INT_ENA  (BIT(8))
#define DPORT_DBUS_CNT_OVF_INT_ENA_M  (BIT(8))
#define DPORT_DBUS_CNT_OVF_INT_ENA_V  0x1
#define DPORT_DBUS_CNT_OVF_INT_ENA_S  8
/* DPORT_DBUS_ACS_MSK_IC_INT_ENA : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define DPORT_DBUS_ACS_MSK_IC_INT_ENA  (BIT(7))
#define DPORT_DBUS_ACS_MSK_IC_INT_ENA_M  (BIT(7))
#define DPORT_DBUS_ACS_MSK_IC_INT_ENA_V  0x1
#define DPORT_DBUS_ACS_MSK_IC_INT_ENA_S  7
/* DPORT_ICACHE_REJECT_INT_ENA : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define DPORT_ICACHE_REJECT_INT_ENA  (BIT(6))
#define DPORT_ICACHE_REJECT_INT_ENA_M  (BIT(6))
#define DPORT_ICACHE_REJECT_INT_ENA_V  0x1
#define DPORT_ICACHE_REJECT_INT_ENA_S  6
/* DPORT_IC_PRELOAD_SIZE_FAULT_INT_ENA : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define DPORT_IC_PRELOAD_SIZE_FAULT_INT_ENA  (BIT(5))
#define DPORT_IC_PRELOAD_SIZE_FAULT_INT_ENA_M  (BIT(5))
#define DPORT_IC_PRELOAD_SIZE_FAULT_INT_ENA_V  0x1
#define DPORT_IC_PRELOAD_SIZE_FAULT_INT_ENA_S  5
/* DPORT_IC_SYNC_SIZE_FAULT_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define DPORT_IC_SYNC_SIZE_FAULT_INT_ENA  (BIT(4))
#define DPORT_IC_SYNC_SIZE_FAULT_INT_ENA_M  (BIT(4))
#define DPORT_IC_SYNC_SIZE_FAULT_INT_ENA_V  0x1
#define DPORT_IC_SYNC_SIZE_FAULT_INT_ENA_S  4
/* DPORT_IBUS_CNT_OVF_INT_ENA : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define DPORT_IBUS_CNT_OVF_INT_ENA  (BIT(3))
#define DPORT_IBUS_CNT_OVF_INT_ENA_M  (BIT(3))
#define DPORT_IBUS_CNT_OVF_INT_ENA_V  0x1
#define DPORT_IBUS_CNT_OVF_INT_ENA_S  3
/* DPORT_IBUS_ACS_MSK_IC_INT_ENA : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define DPORT_IBUS_ACS_MSK_IC_INT_ENA  (BIT(2))
#define DPORT_IBUS_ACS_MSK_IC_INT_ENA_M  (BIT(2))
#define DPORT_IBUS_ACS_MSK_IC_INT_ENA_V  0x1
#define DPORT_IBUS_ACS_MSK_IC_INT_ENA_S  2
/* DPORT_CACHE_DBG_INT_CLR : WOD ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define DPORT_CACHE_DBG_INT_CLR  (BIT(1))
#define DPORT_CACHE_DBG_INT_CLR_M  (BIT(1))
#define DPORT_CACHE_DBG_INT_CLR_V  0x1
#define DPORT_CACHE_DBG_INT_CLR_S  1
/* DPORT_CACHE_DBG_EN : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: */
#define DPORT_CACHE_DBG_EN  (BIT(0))
#define DPORT_CACHE_DBG_EN_M  (BIT(0))
#define DPORT_CACHE_DBG_EN_V  0x1
#define DPORT_CACHE_DBG_EN_S  0

#define DPORT_CACHE_DBG_INT_CLR_REG          (DR_REG_EXTMEM_BASE + 0x10C)
/* DPORT_MMU_ENTRY_FAULT_INT_CLR : WOD ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define DPORT_MMU_ENTRY_FAULT_INT_CLR  (BIT(11))
#define DPORT_MMU_ENTRY_FAULT_INT_CLR_M  (BIT(11))
#define DPORT_MMU_ENTRY_FAULT_INT_CLR_V  0x1
#define DPORT_MMU_ENTRY_FAULT_INT_CLR_S  11
/* DPORT_DCACHE_REJECT_INT_CLR : WOD ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define DPORT_DCACHE_REJECT_INT_CLR  (BIT(10))
#define DPORT_DCACHE_REJECT_INT_CLR_M  (BIT(10))
#define DPORT_DCACHE_REJECT_INT_CLR_V  0x1
#define DPORT_DCACHE_REJECT_INT_CLR_S  10
/* DPORT_DCACHE_WRITE_FLASH_INT_CLR : WOD ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define DPORT_DCACHE_WRITE_FLASH_INT_CLR  (BIT(9))
#define DPORT_DCACHE_WRITE_FLASH_INT_CLR_M  (BIT(9))
#define DPORT_DCACHE_WRITE_FLASH_INT_CLR_V  0x1
#define DPORT_DCACHE_WRITE_FLASH_INT_CLR_S  9
/* DPORT_DC_PRELOAD_SIZE_FAULT_INT_CLR : WOD ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define DPORT_DC_PRELOAD_SIZE_FAULT_INT_CLR  (BIT(8))
#define DPORT_DC_PRELOAD_SIZE_FAULT_INT_CLR_M  (BIT(8))
#define DPORT_DC_PRELOAD_SIZE_FAULT_INT_CLR_V  0x1
#define DPORT_DC_PRELOAD_SIZE_FAULT_INT_CLR_S  8
/* DPORT_DC_SYNC_SIZE_FAULT_INT_CLR : WOD ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define DPORT_DC_SYNC_SIZE_FAULT_INT_CLR  (BIT(7))
#define DPORT_DC_SYNC_SIZE_FAULT_INT_CLR_M  (BIT(7))
#define DPORT_DC_SYNC_SIZE_FAULT_INT_CLR_V  0x1
#define DPORT_DC_SYNC_SIZE_FAULT_INT_CLR_S  7
/* DPORT_DBUS_CNT_OVF_INT_CLR : WOD ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define DPORT_DBUS_CNT_OVF_INT_CLR  (BIT(6))
#define DPORT_DBUS_CNT_OVF_INT_CLR_M  (BIT(6))
#define DPORT_DBUS_CNT_OVF_INT_CLR_V  0x1
#define DPORT_DBUS_CNT_OVF_INT_CLR_S  6
/* DPORT_DBUS_ACS_MSK_IC_INT_CLR : WOD ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define DPORT_DBUS_ACS_MSK_IC_INT_CLR  (BIT(5))
#define DPORT_DBUS_ACS_MSK_IC_INT_CLR_M  (BIT(5))
#define DPORT_DBUS_ACS_MSK_IC_INT_CLR_V  0x1
#define DPORT_DBUS_ACS_MSK_IC_INT_CLR_S  5
/* DPORT_ICACHE_REJECT_INT_CLR : WOD ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define DPORT_ICACHE_REJECT_INT_CLR  (BIT(4))
#define DPORT_ICACHE_REJECT_INT_CLR_M  (BIT(4))
#define DPORT_ICACHE_REJECT_INT_CLR_V  0x1
#define DPORT_ICACHE_REJECT_INT_CLR_S  4
/* DPORT_IC_PRELOAD_SIZE_FAULT_INT_CLR : WOD ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define DPORT_IC_PRELOAD_SIZE_FAULT_INT_CLR  (BIT(3))
#define DPORT_IC_PRELOAD_SIZE_FAULT_INT_CLR_M  (BIT(3))
#define DPORT_IC_PRELOAD_SIZE_FAULT_INT_CLR_V  0x1
#define DPORT_IC_PRELOAD_SIZE_FAULT_INT_CLR_S  3
/* DPORT_IC_SYNC_SIZE_FAULT_INT_CLR : WOD ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define DPORT_IC_SYNC_SIZE_FAULT_INT_CLR  (BIT(2))
#define DPORT_IC_SYNC_SIZE_FAULT_INT_CLR_M  (BIT(2))
#define DPORT_IC_SYNC_SIZE_FAULT_INT_CLR_V  0x1
#define DPORT_IC_SYNC_SIZE_FAULT_INT_CLR_S  2
/* DPORT_IBUS_CNT_OVF_INT_CLR : WOD ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define DPORT_IBUS_CNT_OVF_INT_CLR  (BIT(1))
#define DPORT_IBUS_CNT_OVF_INT_CLR_M  (BIT(1))
#define DPORT_IBUS_CNT_OVF_INT_CLR_V  0x1
#define DPORT_IBUS_CNT_OVF_INT_CLR_S  1
/* DPORT_IBUS_ACS_MSK_IC_INT_CLR : WOD ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define DPORT_IBUS_ACS_MSK_IC_INT_CLR  (BIT(0))
#define DPORT_IBUS_ACS_MSK_IC_INT_CLR_M  (BIT(0))
#define DPORT_IBUS_ACS_MSK_IC_INT_CLR_V  0x1
#define DPORT_IBUS_ACS_MSK_IC_INT_CLR_S  0

