foxval/esp-idf/components/soc/esp32c/include/soc/extmem_reg.h
#define DPORT_CACHE_DBG_STATUS0_REG          (DR_REG_EXTMEM_BASE + 0x110)
/* DPORT_ICACHE_REJECT_ST : RO ;bitpos:[21] ;default: 1'b0 ; */
/*description: */
#define DPORT_ICACHE_REJECT_ST  (BIT(21))
#define DPORT_ICACHE_REJECT_ST_M  (BIT(21))
#define DPORT_ICACHE_REJECT_ST_V  0x1
#define DPORT_ICACHE_REJECT_ST_S  21
/* DPORT_IC_PRELOAD_SIZE_FAULT_ST : RO ;bitpos:[20] ;default: 1'b0 ; */
/*description: */
#define DPORT_IC_PRELOAD_SIZE_FAULT_ST  (BIT(20))
#define DPORT_IC_PRELOAD_SIZE_FAULT_ST_M  (BIT(20))
#define DPORT_IC_PRELOAD_SIZE_FAULT_ST_V  0x1
#define DPORT_IC_PRELOAD_SIZE_FAULT_ST_S  20
/* DPORT_IC_SYNC_SIZE_FAULT_ST : RO ;bitpos:[19] ;default: 1'b0 ; */
/*description: */
#define DPORT_IC_SYNC_SIZE_FAULT_ST  (BIT(19))
#define DPORT_IC_SYNC_SIZE_FAULT_ST_M  (BIT(19))
#define DPORT_IC_SYNC_SIZE_FAULT_ST_V  0x1
#define DPORT_IC_SYNC_SIZE_FAULT_ST_S  19
/* DPORT_IC_PRELOAD_CNT_OVF_ST : RO ;bitpos:[18] ;default: 1'b0 ; */
/*description: */
#define DPORT_IC_PRELOAD_CNT_OVF_ST  (BIT(18))
#define DPORT_IC_PRELOAD_CNT_OVF_ST_M  (BIT(18))
#define DPORT_IC_PRELOAD_CNT_OVF_ST_V  0x1
#define DPORT_IC_PRELOAD_CNT_OVF_ST_S  18
/* DPORT_IC_PRELOAD_EVICT_CNT_OVF_ST : RO ;bitpos:[17] ;default: 1'b0 ; */
/*description: */
#define DPORT_IC_PRELOAD_EVICT_CNT_OVF_ST  (BIT(17))
#define DPORT_IC_PRELOAD_EVICT_CNT_OVF_ST_M  (BIT(17))
#define DPORT_IC_PRELOAD_EVICT_CNT_OVF_ST_V  0x1
#define DPORT_IC_PRELOAD_EVICT_CNT_OVF_ST_S  17
/* DPORT_IC_PRELOAD_MISS_CNT_OVF_ST : RO ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define DPORT_IC_PRELOAD_MISS_CNT_OVF_ST  (BIT(16))
#define DPORT_IC_PRELOAD_MISS_CNT_OVF_ST_M  (BIT(16))
#define DPORT_IC_PRELOAD_MISS_CNT_OVF_ST_V  0x1
#define DPORT_IC_PRELOAD_MISS_CNT_OVF_ST_S  16
/* DPORT_IBUS3_ABANDON_CNT_OVF_ST : RO ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define DPORT_IBUS3_ABANDON_CNT_OVF_ST  (BIT(15))
#define DPORT_IBUS3_ABANDON_CNT_OVF_ST_M  (BIT(15))
#define DPORT_IBUS3_ABANDON_CNT_OVF_ST_V  0x1
#define DPORT_IBUS3_ABANDON_CNT_OVF_ST_S  15
/* DPORT_IBUS2_ABANDON_CNT_OVF_ST : RO ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define DPORT_IBUS2_ABANDON_CNT_OVF_ST  (BIT(14))
#define DPORT_IBUS2_ABANDON_CNT_OVF_ST_M  (BIT(14))
#define DPORT_IBUS2_ABANDON_CNT_OVF_ST_V  0x1
#define DPORT_IBUS2_ABANDON_CNT_OVF_ST_S  14
/* DPORT_IBUS1_ABANDON_CNT_OVF_ST : RO ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define DPORT_IBUS1_ABANDON_CNT_OVF_ST  (BIT(13))
#define DPORT_IBUS1_ABANDON_CNT_OVF_ST_M  (BIT(13))
#define DPORT_IBUS1_ABANDON_CNT_OVF_ST_V  0x1
#define DPORT_IBUS1_ABANDON_CNT_OVF_ST_S  13
/* DPORT_IBUS0_ABANDON_CNT_OVF_ST : RO ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define DPORT_IBUS0_ABANDON_CNT_OVF_ST  (BIT(12))
#define DPORT_IBUS0_ABANDON_CNT_OVF_ST_M  (BIT(12))
#define DPORT_IBUS0_ABANDON_CNT_OVF_ST_V  0x1
#define DPORT_IBUS0_ABANDON_CNT_OVF_ST_S  12
/* DPORT_IBUS3_ACS_MISS_CNT_OVF_ST : RO ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define DPORT_IBUS3_ACS_MISS_CNT_OVF_ST  (BIT(11))
#define DPORT_IBUS3_ACS_MISS_CNT_OVF_ST_M  (BIT(11))
#define DPORT_IBUS3_ACS_MISS_CNT_OVF_ST_V  0x1
#define DPORT_IBUS3_ACS_MISS_CNT_OVF_ST_S  11
/* DPORT_IBUS2_ACS_MISS_CNT_OVF_ST : RO ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define DPORT_IBUS2_ACS_MISS_CNT_OVF_ST  (BIT(10))
#define DPORT_IBUS2_ACS_MISS_CNT_OVF_ST_M  (BIT(10))
#define DPORT_IBUS2_ACS_MISS_CNT_OVF_ST_V  0x1
#define DPORT_IBUS2_ACS_MISS_CNT_OVF_ST_S  10
/* DPORT_IBUS1_ACS_MISS_CNT_OVF_ST : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define DPORT_IBUS1_ACS_MISS_CNT_OVF_ST  (BIT(9))
#define DPORT_IBUS1_ACS_MISS_CNT_OVF_ST_M  (BIT(9))
#define DPORT_IBUS1_ACS_MISS_CNT_OVF_ST_V  0x1
#define DPORT_IBUS1_ACS_MISS_CNT_OVF_ST_S  9
/* DPORT_IBUS0_ACS_MISS_CNT_OVF_ST : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define DPORT_IBUS0_ACS_MISS_CNT_OVF_ST  (BIT(8))
#define DPORT_IBUS0_ACS_MISS_CNT_OVF_ST_M  (BIT(8))
#define DPORT_IBUS0_ACS_MISS_CNT_OVF_ST_V  0x1
#define DPORT_IBUS0_ACS_MISS_CNT_OVF_ST_S  8
/* DPORT_IBUS3_ACS_CNT_OVF_ST : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define DPORT_IBUS3_ACS_CNT_OVF_ST  (BIT(7))
#define DPORT_IBUS3_ACS_CNT_OVF_ST_M  (BIT(7))
#define DPORT_IBUS3_ACS_CNT_OVF_ST_V  0x1
#define DPORT_IBUS3_ACS_CNT_OVF_ST_S  7
/* DPORT_IBUS2_ACS_CNT_OVF_ST : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define DPORT_IBUS2_ACS_CNT_OVF_ST  (BIT(6))
#define DPORT_IBUS2_ACS_CNT_OVF_ST_M  (BIT(6))
#define DPORT_IBUS2_ACS_CNT_OVF_ST_V  0x1
#define DPORT_IBUS2_ACS_CNT_OVF_ST_S  6
/* DPORT_IBUS1_ACS_CNT_OVF_ST : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define DPORT_IBUS1_ACS_CNT_OVF_ST  (BIT(5))
#define DPORT_IBUS1_ACS_CNT_OVF_ST_M  (BIT(5))
#define DPORT_IBUS1_ACS_CNT_OVF_ST_V  0x1
#define DPORT_IBUS1_ACS_CNT_OVF_ST_S  5
/* DPORT_IBUS0_ACS_CNT_OVF_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define DPORT_IBUS0_ACS_CNT_OVF_ST  (BIT(4))
#define DPORT_IBUS0_ACS_CNT_OVF_ST_M  (BIT(4))
#define DPORT_IBUS0_ACS_CNT_OVF_ST_V  0x1
#define DPORT_IBUS0_ACS_CNT_OVF_ST_S  4
/* DPORT_IBUS3_ACS_MSK_ICACHE_ST : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define DPORT_IBUS3_ACS_MSK_ICACHE_ST  (BIT(3))
#define DPORT_IBUS3_ACS_MSK_ICACHE_ST_M  (BIT(3))
#define DPORT_IBUS3_ACS_MSK_ICACHE_ST_V  0x1
#define DPORT_IBUS3_ACS_MSK_ICACHE_ST_S  3
/* DPORT_IBUS2_ACS_MSK_ICACHE_ST : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define DPORT_IBUS2_ACS_MSK_ICACHE_ST  (BIT(2))
#define DPORT_IBUS2_ACS_MSK_ICACHE_ST_M  (BIT(2))
#define DPORT_IBUS2_ACS_MSK_ICACHE_ST_V  0x1
#define DPORT_IBUS2_ACS_MSK_ICACHE_ST_S  2
/* DPORT_IBUS1_ACS_MSK_ICACHE_ST : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define DPORT_IBUS1_ACS_MSK_ICACHE_ST  (BIT(1))
#define DPORT_IBUS1_ACS_MSK_ICACHE_ST_M  (BIT(1))
#define DPORT_IBUS1_ACS_MSK_ICACHE_ST_V  0x1
#define DPORT_IBUS1_ACS_MSK_ICACHE_ST_S  1
/* DPORT_IBUS0_ACS_MSK_ICACHE_ST : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define DPORT_IBUS0_ACS_MSK_ICACHE_ST  (BIT(0))
#define DPORT_IBUS0_ACS_MSK_ICACHE_ST_M  (BIT(0))
#define DPORT_IBUS0_ACS_MSK_ICACHE_ST_V  0x1
#define DPORT_IBUS0_ACS_MSK_ICACHE_ST_S  0

#define DPORT_CACHE_DBG_STATUS1_REG          (DR_REG_EXTMEM_BASE + 0x114)
/* DPORT_MMU_ENTRY_FAULT_ST : RO ;bitpos:[27] ;default: 1'b0 ; */
/*description: */
#define DPORT_MMU_ENTRY_FAULT_ST  (BIT(27))
#define DPORT_MMU_ENTRY_FAULT_ST_M  (BIT(27))
#define DPORT_MMU_ENTRY_FAULT_ST_V  0x1
#define DPORT_MMU_ENTRY_FAULT_ST_S  27
/* DPORT_DCACHE_REJECT_ST : RO ;bitpos:[26] ;default: 1'b0 ; */
/*description: */
#define DPORT_DCACHE_REJECT_ST  (BIT(26))
#define DPORT_DCACHE_REJECT_ST_M  (BIT(26))
#define DPORT_DCACHE_REJECT_ST_V  0x1
#define DPORT_DCACHE_REJECT_ST_S  26
/* DPORT_DCACHE_WRITE_FLASH_ST : RO ;bitpos:[25] ;default: 1'b0 ; */
/*description: */
#define DPORT_DCACHE_WRITE_FLASH_ST  (BIT(25))
#define DPORT_DCACHE_WRITE_FLASH_ST_M  (BIT(25))
#define DPORT_DCACHE_WRITE_FLASH_ST_V  0x1
#define DPORT_DCACHE_WRITE_FLASH_ST_S  25
/* DPORT_DC_PRELOAD_SIZE_FAULT_ST : RO ;bitpos:[24] ;default: 1'b0 ; */
/*description: */
#define DPORT_DC_PRELOAD_SIZE_FAULT_ST  (BIT(24))
#define DPORT_DC_PRELOAD_SIZE_FAULT_ST_M  (BIT(24))
#define DPORT_DC_PRELOAD_SIZE_FAULT_ST_V  0x1
#define DPORT_DC_PRELOAD_SIZE_FAULT_ST_S  24
/* DPORT_DC_SYNC_SIZE_FAULT_ST : RO ;bitpos:[23] ;default: 1'b0 ; */
/*description: */
#define DPORT_DC_SYNC_SIZE_FAULT_ST  (BIT(23))
#define DPORT_DC_SYNC_SIZE_FAULT_ST_M  (BIT(23))
#define DPORT_DC_SYNC_SIZE_FAULT_ST_V  0x1
#define DPORT_DC_SYNC_SIZE_FAULT_ST_S  23
/* DPORT_DC_PRELOAD_CNT_OVF_ST : RO ;bitpos:[22] ;default: 1'b0 ; */
/*description: */
#define DPORT_DC_PRELOAD_CNT_OVF_ST  (BIT(22))
#define DPORT_DC_PRELOAD_CNT_OVF_ST_M  (BIT(22))
#define DPORT_DC_PRELOAD_CNT_OVF_ST_V  0x1
#define DPORT_DC_PRELOAD_CNT_OVF_ST_S  22
/* DPORT_DC_PRELOAD_EVICT_CNT_OVF_ST : RO ;bitpos:[21] ;default: 1'b0 ; */
/*description: */
#define DPORT_DC_PRELOAD_EVICT_CNT_OVF_ST  (BIT(21))
#define DPORT_DC_PRELOAD_EVICT_CNT_OVF_ST_M  (BIT(21))
#define DPORT_DC_PRELOAD_EVICT_CNT_OVF_ST_V  0x1
#define DPORT_DC_PRELOAD_EVICT_CNT_OVF_ST_S  21
/* DPORT_DC_PRELOAD_MISS_CNT_OVF_ST : RO ;bitpos:[20] ;default: 1'b0 ; */
/*description: */
#define DPORT_DC_PRELOAD_MISS_CNT_OVF_ST  (BIT(20))
#define DPORT_DC_PRELOAD_MISS_CNT_OVF_ST_M  (BIT(20))
#define DPORT_DC_PRELOAD_MISS_CNT_OVF_ST_V  0x1
#define DPORT_DC_PRELOAD_MISS_CNT_OVF_ST_S  20
/* DPORT_DBUS3_ABANDON_CNT_OVF_ST : RO ;bitpos:[19] ;default: 1'b0 ; */
/*description: */
#define DPORT_DBUS3_ABANDON_CNT_OVF_ST  (BIT(19))
#define DPORT_DBUS3_ABANDON_CNT_OVF_ST_M  (BIT(19))
#define DPORT_DBUS3_ABANDON_CNT_OVF_ST_V  0x1
#define DPORT_DBUS3_ABANDON_CNT_OVF_ST_S  19
/* DPORT_DBUS2_ABANDON_CNT_OVF_ST : RO ;bitpos:[18] ;default: 1'b0 ; */
/*description: */
#define DPORT_DBUS2_ABANDON_CNT_OVF_ST  (BIT(18))
#define DPORT_DBUS2_ABANDON_CNT_OVF_ST_M  (BIT(18))
#define DPORT_DBUS2_ABANDON_CNT_OVF_ST_V  0x1
#define DPORT_DBUS2_ABANDON_CNT_OVF_ST_S  18
/* DPORT_DBUS1_ABANDON_CNT_OVF_ST : RO ;bitpos:[17] ;default: 1'b0 ; */
/*description: */
#define DPORT_DBUS1_ABANDON_CNT_OVF_ST  (BIT(17))
#define DPORT_DBUS1_ABANDON_CNT_OVF_ST_M  (BIT(17))
#define DPORT_DBUS1_ABANDON_CNT_OVF_ST_V  0x1
#define DPORT_DBUS1_ABANDON_CNT_OVF_ST_S  17
/* DPORT_DBUS0_ABANDON_CNT_OVF_ST : RO ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define DPORT_DBUS0_ABANDON_CNT_OVF_ST  (BIT(16))
#define DPORT_DBUS0_ABANDON_CNT_OVF_ST_M  (BIT(16))
#define DPORT_DBUS0_ABANDON_CNT_OVF_ST_V  0x1
#define DPORT_DBUS0_ABANDON_CNT_OVF_ST_S  16
/* DPORT_DBUS3_ACS_WB_CNT_OVF_ST : RO ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define DPORT_DBUS3_ACS_WB_CNT_OVF_ST  (BIT(15))
#define DPORT_DBUS3_ACS_WB_CNT_OVF_ST_M  (BIT(15))
#define DPORT_DBUS3_ACS_WB_CNT_OVF_ST_V  0x1
#define DPORT_DBUS3_ACS_WB_CNT_OVF_ST_S  15
/* DPORT_DBUS2_ACS_WB_CNT_OVF_ST : RO ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define DPORT_DBUS2_ACS_WB_CNT_OVF_ST  (BIT(14))
#define DPORT_DBUS2_ACS_WB_CNT_OVF_ST_M  (BIT(14))
#define DPORT_DBUS2_ACS_WB_CNT_OVF_ST_V  0x1
#define DPORT_DBUS2_ACS_WB_CNT_OVF_ST_S  14
/* DPORT_DBUS1_ACS_WB_CNT_OVF_ST : RO ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define DPORT_DBUS1_ACS_WB_CNT_OVF_ST  (BIT(13))
#define DPORT_DBUS1_ACS_WB_CNT_OVF_ST_M  (BIT(13))
#define DPORT_DBUS1_ACS_WB_CNT_OVF_ST_V  0x1
#define DPORT_DBUS1_ACS_WB_CNT_OVF_ST_S  13
/* DPORT_DBUS0_ACS_WB_CNT_OVF_ST : RO ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define DPORT_DBUS0_ACS_WB_CNT_OVF_ST  (BIT(12))
#define DPORT_DBUS0_ACS_WB_CNT_OVF_ST_M  (BIT(12))
#define DPORT_DBUS0_ACS_WB_CNT_OVF_ST_V  0x1
#define DPORT_DBUS0_ACS_WB_CNT_OVF_ST_S  12
/* DPORT_DBUS3_ACS_MISS_CNT_OVF_ST : RO ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define DPORT_DBUS3_ACS_MISS_CNT_OVF_ST  (BIT(11))
#define DPORT_DBUS3_ACS_MISS_CNT_OVF_ST_M  (BIT(11))
#define DPORT_DBUS3_ACS_MISS_CNT_OVF_ST_V  0x1
#define DPORT_DBUS3_ACS_MISS_CNT_OVF_ST_S  11
/* DPORT_DBUS2_ACS_MISS_CNT_OVF_ST : RO ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define DPORT_DBUS2_ACS_MISS_CNT_OVF_ST  (BIT(10))
#define DPORT_DBUS2_ACS_MISS_CNT_OVF_ST_M  (BIT(10))
#define DPORT_DBUS2_ACS_MISS_CNT_OVF_ST_V  0x1
#define DPORT_DBUS2_ACS_MISS_CNT_OVF_ST_S  10
/* DPORT_DBUS1_ACS_MISS_CNT_OVF_ST : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define DPORT_DBUS1_ACS_MISS_CNT_OVF_ST  (BIT(9))
#define DPORT_DBUS1_ACS_MISS_CNT_OVF_ST_M  (BIT(9))
#define DPORT_DBUS1_ACS_MISS_CNT_OVF_ST_V  0x1
#define DPORT_DBUS1_ACS_MISS_CNT_OVF_ST_S  9
/* DPORT_DBUS0_ACS_MISS_CNT_OVF_ST : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define DPORT_DBUS0_ACS_MISS_CNT_OVF_ST  (BIT(8))
#define DPORT_DBUS0_ACS_MISS_CNT_OVF_ST_M  (BIT(8))
#define DPORT_DBUS0_ACS_MISS_CNT_OVF_ST_V  0x1
#define DPORT_DBUS0_ACS_MISS_CNT_OVF_ST_S  8
/* DPORT_DBUS3_ACS_CNT_OVF_ST : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define DPORT_DBUS3_ACS_CNT_OVF_ST  (BIT(7))
#define DPORT_DBUS3_ACS_CNT_OVF_ST_M  (BIT(7))
#define DPORT_DBUS3_ACS_CNT_OVF_ST_V  0x1
#define DPORT_DBUS3_ACS_CNT_OVF_ST_S  7
/* DPORT_DBUS2_ACS_CNT_OVF_ST : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define DPORT_DBUS2_ACS_CNT_OVF_ST  (BIT(6))
#define DPORT_DBUS2_ACS_CNT_OVF_ST_M  (BIT(6))
#define DPORT_DBUS2_ACS_CNT_OVF_ST_V  0x1
#define DPORT_DBUS2_ACS_CNT_OVF_ST_S  6
/* DPORT_DBUS1_ACS_CNT_OVF_ST : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define DPORT_DBUS1_ACS_CNT_OVF_ST  (BIT(5))
#define DPORT_DBUS1_ACS_CNT_OVF_ST_M  (BIT(5))
#define DPORT_DBUS1_ACS_CNT_OVF_ST_V  0x1
#define DPORT_DBUS1_ACS_CNT_OVF_ST_S  5
/* DPORT_DBUS0_ACS_CNT_OVF_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define DPORT_DBUS0_ACS_CNT_OVF_ST  (BIT(4))
#define DPORT_DBUS0_ACS_CNT_OVF_ST_M  (BIT(4))
#define DPORT_DBUS0_ACS_CNT_OVF_ST_V  0x1
#define DPORT_DBUS0_ACS_CNT_OVF_ST_S  4
/* DPORT_DBUS3_ACS_MSK_DCACHE_ST : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define DPORT_DBUS3_ACS_MSK_DCACHE_ST  (BIT(3))
#define DPORT_DBUS3_ACS_MSK_DCACHE_ST_M  (BIT(3))
#define DPORT_DBUS3_ACS_MSK_DCACHE_ST_V  0x1
#define DPORT_DBUS3_ACS_MSK_DCACHE_ST_S  3
/* DPORT_DBUS2_ACS_MSK_DCACHE_ST : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define DPORT_DBUS2_ACS_MSK_DCACHE_ST  (BIT(2))
#define DPORT_DBUS2_ACS_MSK_DCACHE_ST_M  (BIT(2))
#define DPORT_DBUS2_ACS_MSK_DCACHE_ST_V  0x1
#define DPORT_DBUS2_ACS_MSK_DCACHE_ST_S  2
/* DPORT_DBUS1_ACS_MSK_DCACHE_ST : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define DPORT_DBUS1_ACS_MSK_DCACHE_ST  (BIT(1))
#define DPORT_DBUS1_ACS_MSK_DCACHE_ST_M  (BIT(1))
#define DPORT_DBUS1_ACS_MSK_DCACHE_ST_V  0x1
#define DPORT_DBUS1_ACS_MSK_DCACHE_ST_S  1
/* DPORT_DBUS0_ACS_MSK_DCACHE_ST : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define DPORT_DBUS0_ACS_MSK_DCACHE_ST  (BIT(0))
#define DPORT_DBUS0_ACS_MSK_DCACHE_ST_M  (BIT(0))
#define DPORT_DBUS0_ACS_MSK_DCACHE_ST_V  0x1
#define DPORT_DBUS0_ACS_MSK_DCACHE_ST_S  0

#define DPORT_PRO_CACHE_ACS_CNT_CLR_REG          (DR_REG_EXTMEM_BASE + 0x118)
/* DPORT_PRO_ICACHE_ACS_CNT_CLR : WOD ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_ICACHE_ACS_CNT_CLR  (BIT(1))
#define DPORT_PRO_ICACHE_ACS_CNT_CLR_M  (BIT(1))
#define DPORT_PRO_ICACHE_ACS_CNT_CLR_V  0x1
#define DPORT_PRO_ICACHE_ACS_CNT_CLR_S  1
/* DPORT_PRO_DCACHE_ACS_CNT_CLR : WOD ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_DCACHE_ACS_CNT_CLR  (BIT(0))
#define DPORT_PRO_DCACHE_ACS_CNT_CLR_M  (BIT(0))
#define DPORT_PRO_DCACHE_ACS_CNT_CLR_V  0x1
#define DPORT_PRO_DCACHE_ACS_CNT_CLR_S  0

#define DPORT_PRO_DCACHE_REJECT_ST_REG          (DR_REG_EXTMEM_BASE + 0x11C)
/* DPORT_PRO_DCACHE_CPU_ATTR : RO ;bitpos:[5:3] ;default: 3'b0 ; */
/*description: */
#define DPORT_PRO_DCACHE_CPU_ATTR  0x00000007
#define DPORT_PRO_DCACHE_CPU_ATTR_M  ((DPORT_PRO_DCACHE_CPU_ATTR_V)<<(DPORT_PRO_DCACHE_CPU_ATTR_S))
#define DPORT_PRO_DCACHE_CPU_ATTR_V  0x7
#define DPORT_PRO_DCACHE_CPU_ATTR_S  3
/* DPORT_PRO_DCACHE_TAG_ATTR : RO ;bitpos:[2:0] ;default: 3'b0 ; */
/*description: */
#define DPORT_PRO_DCACHE_TAG_ATTR  0x00000007
#define DPORT_PRO_DCACHE_TAG_ATTR_M  ((DPORT_PRO_DCACHE_TAG_ATTR_V)<<(DPORT_PRO_DCACHE_TAG_ATTR_S))
#define DPORT_PRO_DCACHE_TAG_ATTR_V  0x7
#define DPORT_PRO_DCACHE_TAG_ATTR_S  0

#define DPORT_PRO_DCACHE_REJECT_VADDR_REG          (DR_REG_EXTMEM_BASE + 0x120)
/* DPORT_PRO_DCACHE_CPU_VADDR : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define DPORT_PRO_DCACHE_CPU_VADDR  0xFFFFFFFF
#define DPORT_PRO_DCACHE_CPU_VADDR_M  ((DPORT_PRO_DCACHE_CPU_VADDR_V)<<(DPORT_PRO_DCACHE_CPU_VADDR_S))
#define DPORT_PRO_DCACHE_CPU_VADDR_V  0xFFFFFFFF
#define DPORT_PRO_DCACHE_CPU_VADDR_S  0

#define DPORT_PRO_ICACHE_REJECT_ST_REG          (DR_REG_EXTMEM_BASE + 0x124)
/* DPORT_PRO_ICACHE_CPU_ATTR : RO ;bitpos:[5:3] ;default: 3'b0 ; */
/*description: */
#define DPORT_PRO_ICACHE_CPU_ATTR  0x00000007
#define DPORT_PRO_ICACHE_CPU_ATTR_M  ((DPORT_PRO_ICACHE_CPU_ATTR_V)<<(DPORT_PRO_ICACHE_CPU_ATTR_S))
#define DPORT_PRO_ICACHE_CPU_ATTR_V  0x7
#define DPORT_PRO_ICACHE_CPU_ATTR_S  3
/* DPORT_PRO_ICACHE_TAG_ATTR : RO ;bitpos:[2:0] ;default: 3'b0 ; */
/*description: */
#define DPORT_PRO_ICACHE_TAG_ATTR  0x00000007
#define DPORT_PRO_ICACHE_TAG_ATTR_M  ((DPORT_PRO_ICACHE_TAG_ATTR_V)<<(DPORT_PRO_ICACHE_TAG_ATTR_S))
#define DPORT_PRO_ICACHE_TAG_ATTR_V  0x7
#define DPORT_PRO_ICACHE_TAG_ATTR_S  0

#define DPORT_PRO_ICACHE_REJECT_VADDR_REG          (DR_REG_EXTMEM_BASE + 0x128)
/* DPORT_PRO_ICACHE_CPU_VADDR : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define DPORT_PRO_ICACHE_CPU_VADDR  0xFFFFFFFF
#define DPORT_PRO_ICACHE_CPU_VADDR_M  ((DPORT_PRO_ICACHE_CPU_VADDR_V)<<(DPORT_PRO_ICACHE_CPU_VADDR_S))
#define DPORT_PRO_ICACHE_CPU_VADDR_V  0xFFFFFFFF
#define DPORT_PRO_ICACHE_CPU_VADDR_S  0

