foxval/esp-idf/components/soc/esp32c/include/soc/extmem_reg.h
#define DPORT_PRO_CACHE_MMU_FAULT_CONTENT_REG          (DR_REG_EXTMEM_BASE + 0x12C)
/* DPORT_PRO_CACHE_MMU_FAULT_CONTENT : RO ;bitpos:[16:0] ;default: 17'h0 ; */
/*description: */
#define DPORT_PRO_CACHE_MMU_FAULT_CONTENT  0x0001FFFF
#define DPORT_PRO_CACHE_MMU_FAULT_CONTENT_M  ((DPORT_PRO_CACHE_MMU_FAULT_CONTENT_V)<<(DPORT_PRO_CACHE_MMU_FAULT_CONTENT_S))
#define DPORT_PRO_CACHE_MMU_FAULT_CONTENT_V  0x1FFFF
#define DPORT_PRO_CACHE_MMU_FAULT_CONTENT_S  0

#define DPORT_PRO_CACHE_MMU_FAULT_VADDR_REG          (DR_REG_EXTMEM_BASE + 0x130)
/* DPORT_PRO_CACHE_MMU_FAULT_VADDR : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define DPORT_PRO_CACHE_MMU_FAULT_VADDR  0xFFFFFFFF
#define DPORT_PRO_CACHE_MMU_FAULT_VADDR_M  ((DPORT_PRO_CACHE_MMU_FAULT_VADDR_V)<<(DPORT_PRO_CACHE_MMU_FAULT_VADDR_S))
#define DPORT_PRO_CACHE_MMU_FAULT_VADDR_V  0xFFFFFFFF
#define DPORT_PRO_CACHE_MMU_FAULT_VADDR_S  0

#define DPORT_PRO_CACHE_WRAP_AROUND_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x134)
/* DPORT_PRO_CACHE_SRAM_RD_WRAP_AROUND : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_CACHE_SRAM_RD_WRAP_AROUND  (BIT(1))
#define DPORT_PRO_CACHE_SRAM_RD_WRAP_AROUND_M  (BIT(1))
#define DPORT_PRO_CACHE_SRAM_RD_WRAP_AROUND_V  0x1
#define DPORT_PRO_CACHE_SRAM_RD_WRAP_AROUND_S  1
/* DPORT_PRO_CACHE_FLASH_WRAP_AROUND : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_CACHE_FLASH_WRAP_AROUND  (BIT(0))
#define DPORT_PRO_CACHE_FLASH_WRAP_AROUND_M  (BIT(0))
#define DPORT_PRO_CACHE_FLASH_WRAP_AROUND_V  0x1
#define DPORT_PRO_CACHE_FLASH_WRAP_AROUND_S  0

#define DPORT_PRO_CACHE_MMU_POWER_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x138)
/* DPORT_PRO_CACHE_MMU_MEM_PD : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_CACHE_MMU_MEM_PD  (BIT(1))
#define DPORT_PRO_CACHE_MMU_MEM_PD_M  (BIT(1))
#define DPORT_PRO_CACHE_MMU_MEM_PD_V  0x1
#define DPORT_PRO_CACHE_MMU_MEM_PD_S  1
/* DPORT_PRO_CACHE_MMU_MEM_FORCE_ON : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: */
#define DPORT_PRO_CACHE_MMU_MEM_FORCE_ON  (BIT(0))
#define DPORT_PRO_CACHE_MMU_MEM_FORCE_ON_M  (BIT(0))
#define DPORT_PRO_CACHE_MMU_MEM_FORCE_ON_V  0x1
#define DPORT_PRO_CACHE_MMU_MEM_FORCE_ON_S  0

#define DPORT_PRO_CACHE_STATE_REG          (DR_REG_EXTMEM_BASE + 0x13C)
/* DPORT_PRO_DCACHE_STATE : RO ;bitpos:[23:12] ;default: 12'h0 ; */
/*description: */
#define DPORT_PRO_DCACHE_STATE  0x00000FFF
#define DPORT_PRO_DCACHE_STATE_M  ((DPORT_PRO_DCACHE_STATE_V)<<(DPORT_PRO_DCACHE_STATE_S))
#define DPORT_PRO_DCACHE_STATE_V  0xFFF
#define DPORT_PRO_DCACHE_STATE_S  12
/* DPORT_PRO_ICACHE_STATE : RO ;bitpos:[11:0] ;default: 12'h0 ; */
/*description: */
#define DPORT_PRO_ICACHE_STATE  0x00000FFF
#define DPORT_PRO_ICACHE_STATE_M  ((DPORT_PRO_ICACHE_STATE_V)<<(DPORT_PRO_ICACHE_STATE_S))
#define DPORT_PRO_ICACHE_STATE_V  0xFFF
#define DPORT_PRO_ICACHE_STATE_S  0

#define DPORT_CACHE_ENCRYPT_DECRYPT_RECORD_DISABLE_REG          (DR_REG_EXTMEM_BASE + 0x140)
/* DPORT_RECORD_DISABLE_G0CB_DECRYPT : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define DPORT_RECORD_DISABLE_G0CB_DECRYPT  (BIT(1))
#define DPORT_RECORD_DISABLE_G0CB_DECRYPT_M  (BIT(1))
#define DPORT_RECORD_DISABLE_G0CB_DECRYPT_V  0x1
#define DPORT_RECORD_DISABLE_G0CB_DECRYPT_S  1
/* DPORT_RECORD_DISABLE_DB_ENCRYPT : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define DPORT_RECORD_DISABLE_DB_ENCRYPT  (BIT(0))
#define DPORT_RECORD_DISABLE_DB_ENCRYPT_M  (BIT(0))
#define DPORT_RECORD_DISABLE_DB_ENCRYPT_V  0x1
#define DPORT_RECORD_DISABLE_DB_ENCRYPT_S  0

#define DPORT_CACHE_ENCRYPT_DECRYPT_CLK_FORCE_ON_REG          (DR_REG_EXTMEM_BASE + 0x144)
/* DPORT_CLK_FORCE_ON_AUTOMATIC_ENCRYPT_DECRYPT : R/W ;bitpos:[2] ;default: 1'b1 ; */
/*description: */
#define DPORT_CLK_FORCE_ON_AUTOMATIC_ENCRYPT_DECRYPT  (BIT(2))
#define DPORT_CLK_FORCE_ON_AUTOMATIC_ENCRYPT_DECRYPT_M  (BIT(2))
#define DPORT_CLK_FORCE_ON_AUTOMATIC_ENCRYPT_DECRYPT_V  0x1
#define DPORT_CLK_FORCE_ON_AUTOMATIC_ENCRYPT_DECRYPT_S  2
/* DPORT_CLK_FORCE_ON_G0CB_DECRYPT : R/W ;bitpos:[1] ;default: 1'b1 ; */
/*description: */
#define DPORT_CLK_FORCE_ON_G0CB_DECRYPT  (BIT(1))
#define DPORT_CLK_FORCE_ON_G0CB_DECRYPT_M  (BIT(1))
#define DPORT_CLK_FORCE_ON_G0CB_DECRYPT_V  0x1
#define DPORT_CLK_FORCE_ON_G0CB_DECRYPT_S  1
/* DPORT_CLK_FORCE_ON_DB_ENCRYPT : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: */
#define DPORT_CLK_FORCE_ON_DB_ENCRYPT  (BIT(0))
#define DPORT_CLK_FORCE_ON_DB_ENCRYPT_M  (BIT(0))
#define DPORT_CLK_FORCE_ON_DB_ENCRYPT_V  0x1
#define DPORT_CLK_FORCE_ON_DB_ENCRYPT_S  0

#define DPORT_CACHE_BRIDGE_ARBITER_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x148)
/* DPORT_ALLOC_WB_HOLD_ARBITER : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define DPORT_ALLOC_WB_HOLD_ARBITER  (BIT(0))
#define DPORT_ALLOC_WB_HOLD_ARBITER_M  (BIT(0))
#define DPORT_ALLOC_WB_HOLD_ARBITER_V  0x1
#define DPORT_ALLOC_WB_HOLD_ARBITER_S  0

#define DPORT_CACHE_PRELOAD_INT_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x14C)
/* DPORT_PRO_DCACHE_PRELOAD_INT_CLR : WOD ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_DCACHE_PRELOAD_INT_CLR  (BIT(5))
#define DPORT_PRO_DCACHE_PRELOAD_INT_CLR_M  (BIT(5))
#define DPORT_PRO_DCACHE_PRELOAD_INT_CLR_V  0x1
#define DPORT_PRO_DCACHE_PRELOAD_INT_CLR_S  5
/* DPORT_PRO_DCACHE_PRELOAD_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_DCACHE_PRELOAD_INT_ENA  (BIT(4))
#define DPORT_PRO_DCACHE_PRELOAD_INT_ENA_M  (BIT(4))
#define DPORT_PRO_DCACHE_PRELOAD_INT_ENA_V  0x1
#define DPORT_PRO_DCACHE_PRELOAD_INT_ENA_S  4
/* DPORT_PRO_DCACHE_PRELOAD_INT_ST : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_DCACHE_PRELOAD_INT_ST  (BIT(3))
#define DPORT_PRO_DCACHE_PRELOAD_INT_ST_M  (BIT(3))
#define DPORT_PRO_DCACHE_PRELOAD_INT_ST_V  0x1
#define DPORT_PRO_DCACHE_PRELOAD_INT_ST_S  3
/* DPORT_PRO_ICACHE_PRELOAD_INT_CLR : WOD ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_ICACHE_PRELOAD_INT_CLR  (BIT(2))
#define DPORT_PRO_ICACHE_PRELOAD_INT_CLR_M  (BIT(2))
#define DPORT_PRO_ICACHE_PRELOAD_INT_CLR_V  0x1
#define DPORT_PRO_ICACHE_PRELOAD_INT_CLR_S  2
/* DPORT_PRO_ICACHE_PRELOAD_INT_ENA : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_ICACHE_PRELOAD_INT_ENA  (BIT(1))
#define DPORT_PRO_ICACHE_PRELOAD_INT_ENA_M  (BIT(1))
#define DPORT_PRO_ICACHE_PRELOAD_INT_ENA_V  0x1
#define DPORT_PRO_ICACHE_PRELOAD_INT_ENA_S  1
/* DPORT_PRO_ICACHE_PRELOAD_INT_ST : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_ICACHE_PRELOAD_INT_ST  (BIT(0))
#define DPORT_PRO_ICACHE_PRELOAD_INT_ST_M  (BIT(0))
#define DPORT_PRO_ICACHE_PRELOAD_INT_ST_V  0x1
#define DPORT_PRO_ICACHE_PRELOAD_INT_ST_S  0

#define DPORT_CACHE_CONF_MISC_REG          (DR_REG_EXTMEM_BASE + 0x150)
/* DPORT_PRO_CACHE_IGNORE_SYNC_MMU_ENTRY_FAULT : R/W ;bitpos:[1] ;default: 1'b1 ; */
/*description: */
#define DPORT_PRO_CACHE_IGNORE_SYNC_MMU_ENTRY_FAULT  (BIT(1))
#define DPORT_PRO_CACHE_IGNORE_SYNC_MMU_ENTRY_FAULT_M  (BIT(1))
#define DPORT_PRO_CACHE_IGNORE_SYNC_MMU_ENTRY_FAULT_V  0x1
#define DPORT_PRO_CACHE_IGNORE_SYNC_MMU_ENTRY_FAULT_S  1
/* DPORT_PRO_CACHE_IGNORE_PRELOAD_MMU_ENTRY_FAULT : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: */
#define DPORT_PRO_CACHE_IGNORE_PRELOAD_MMU_ENTRY_FAULT  (BIT(0))
#define DPORT_PRO_CACHE_IGNORE_PRELOAD_MMU_ENTRY_FAULT_M  (BIT(0))
#define DPORT_PRO_CACHE_IGNORE_PRELOAD_MMU_ENTRY_FAULT_V  0x1
#define DPORT_PRO_CACHE_IGNORE_PRELOAD_MMU_ENTRY_FAULT_S  0

#define EXTMEM_CLOCK_GATE_REG          (DR_REG_EXTMEM_BASE + 0x154)
/* EXTMEM_CLK_EN : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: */
#define EXTMEM_CLK_EN  (BIT(0))
#define EXTMEM_CLK_EN_M  (BIT(0))
#define EXTMEM_CLK_EN_V  0x1
#define EXTMEM_CLK_EN_S  0

#define EXTMEM_DATE_REG          (DR_REG_EXTMEM_BASE + 0x3FC)
/* EXTMEM_DATE : R/W ;bitpos:[27:0] ;default: 28'h1812130 ; */
/*description: */
#define EXTMEM_DATE  0x0FFFFFFF
#define EXTMEM_DATE_M  ((EXTMEM_DATE_V)<<(EXTMEM_DATE_S))
#define EXTMEM_DATE_V  0xFFFFFFF
#define EXTMEM_DATE_S  0

#ifdef __cplusplus
}
#endif



#endif /*_SOC_EXTMEM_REG_H_ */


